GIT - распределенная система контроля версий это система для отслеживания и ведения
истории изменения файлов, а вашем проекте. При помощи распределенности git ещё
и организовывается командная работа.

Репозиторий - это хранилище вашего кода и истории его изменений

GitHub - веб сайт для размещения git-репозиториев в совместной разработке пректов


------------------------------------------------------------------

# Команды GIT:

# 1. git init -> она создает локальный гит репозиторий у вас на пк, в той директории в которой была прописана команда. 

# 2. git status -> команда для проверки статуса наших файлов

# 3. git add -> команда для добавления файлов в систему отслеживания гита, после этой комнады изменения начинают фиксироваться 

# 4. git commit -m 'comment' -> комaнада для сохранения версии в локальном репозитории, вместе с комментарием к изменениеям

# 5. git remote add origin <url> -> это команда для того чтобы установить связь локального репозитория с удаленным в гитхабе

# 6. git push -> комнада для отправки ваших изменений в локальном репо в удалeнный репо
        # git push origin main

# -----------------------

# 1*) git init
#         2) git add .
#         3) git commit -m ''
# 4*) git remote add origin <url>
#         5) git push origin main
# 